#str
#int
#float
#bytes
#bool

a = 1
b = 1.2
c = "Тесктовый тип данных"
d = bytes("Формат передачи данных".encode())
t = True
f = False
print("Программно разработчик создал следующие переменные:", a,",", b, "и другие.")
aUser = input("Введите целое числовое значение")
bUser = input("Введите число с разделителем")
cUser = input("Введите первую мысль, которая пришла Вам в голову")
print("Вам повезло! Скоро в Вашей жизни произойдет ",aUser,"прекрасных событий, которых лишь ",bUser,"будет особенно приятных. Ваши близкие на это скажут",cUser, " Удачи!")